Revit 2027 API
ExternalCommandsData.AssemblyName Property
 The assembly path of the menu item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AssemblyName { get; set; }
Public Property AssemblyName As String
	Get
	Set
public:
property String^ AssemblyName {
	String^ get ();
	void set (String^ value);
}
member AssemblyName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 The path of the assembly which contains the corresponding external command.
See Also
Reference
ExternalCommandsData Class
Autodesk.Revit.UI Namespace